#fetching data from database using keys and after that storing and then
# generation that data in xlsx format using xlsxwriter module ...as per requirement.

import os, sys
import pyodbc
import pandas as pd
import xlsxwriter

conn = pyodbc.connect('Driver={ODBC Driver 17 for SQL Server};'
                      'Server=RAMAN-RANJAN;'
                      'Database=SECAC087;'
                      'Trusted_Connection=yes;')


# cursor = conn.cursor()
# cursor.execute('')
#
# for i in cursor:
#     print(i)

#     import pyodbc
# s = "2"

def crtD(n, e, s, id, pan):
    with pd.ExcelWriter(pan + "ward" + n + ".xlsx", engine="xlsxwriter",
                        options={'strings_to_numbers': True, 'strings_to_formulas': False}) as writer:
        try:
            df = pd.read_sql(
                "SELECT TOP (100000) AUTO_ID,ELECTOR_ID,SOLR_ID,ST_CODE,AC_NO,PART_NO,SECTION_NO,SLNOINPART,C_HOUSE_NO,C_HOUSE_NO_V1,P_HOUSE_NO,P_HOUSE_NO_V1,FM_NAME_EN,LASTNAME_EN,FM_NAME_V1+'  '+LASTNAME_V1 as name,RLN_TYPE,RLN_FM_NM_EN,RLN_L_NM_EN,RLN_FM_NM_V1 +'  ' +RLN_L_NM_V1 as fname,EPIC_NO,STATUS_TYPE,GENDER,AGE,EMAIL_ID,MOBILE_NO,PASSPORT_NO,FORM_NO,DUPLICATE_ID_STATE,ELECTOR_TYPE,ORG_LIST_NO,CNG_LIST_NO,VIP,MFLAG,DFLAG,P_STREET_AREA,P_VILLAGE,P_POST_OFFICE,P_DISTRICT_NO,P_PIN_CODE,P_STREET_AREA_V1,P_VILLAGE_V1,P_POST_OFFICE_V1,P_DISTRICT_NO_V1,P_PIN_CODE_V1,C_STREET_AREA,C_VILLAGE,C_POST_OFFICE,C_DISTRICT_NO,C_STATE_NAME ,C_PIN_CODE,C_COUNTRY,C_STREET_AREA_V1 ,C_VILLAGE_V1,C_POST_OFFICE_V1,C_DISTRICT_NO_V1,C_PIN_CODE_V1,BlockID,PanchayatID,VillageName,WardNo,SlNoInWard,ActionDate,UserId,N'" + e + " ' as mat, N' " + s + "' as gram FROM EROLL where PanchayatID = " + id + "AND WardNo=" + n,
                conn)
            df.to_excel(writer, sheet_name="Sheet2", header=True, index=False)
            print("File saved successfully!")
        except:
            print("There is an error")


# जतुका  पैकटोल  वार्ड  काउंट - 15
id2 = "130010006"
pan2 = "गररी"
gra2 = "ग्राम  पंचायत  गररी जाले "
mat2 = ["74  मध्य  विद्यालय  पौनी  भाग  1", "75  विद्यालय  पौनी  भाग  2", "76  मदरसा  रहमानिया  गडरी  भाग  1",
        "77  मदरसा  रहमानिया  गरडी  भाग  2", "78  मदरसा  रहमानिया  गरडी  भाग  3", "79  मदरसा  रहमानिया  गरडी  भाग  4",
        "फडफ", "द्फ्द्फ़",
        "ग्ग्फ़", "फ्द्फद्फ़", "फ्द्फद्फ़", "द्फ्द्फ़", "द्फ्द्फद्फ़", "87  प्राथमिक  विद्यालय  राधोपुर",
        "88  प्राथमिक  विद्यालय  कमलपुर"]

# गंगौली  कनकपुर  वार्ड काउंट - 14
id3 = "130010024"
pan3 = "ब्रहमपुर पश्चिमी"
gra3 = "ग्राम  पंचायत  ब्रहमपुर पश्चिमी  जाले "
mat3 = ["328  पंचायत  भवन  ब्रहमपुर  भाग  1", "329  पंचायत  भवन  ब्रहमपुर  भाग  2",
        "330  मध्य  वि०  ब्रहमपुर  दक्षिणी  भाग  1", "331  मध्य  वि०  ब्रहमपुर  दक्षिण  भवन  भाग  2",
        "332  मध्य  वि०  ब्रहमपुर  दक्षिण  भवन  भाग  3", "333  प्राथमिक  विद्यालय  ब्रहमपुर  कन्या",
        "334  मध्य  वि०  ब्रहमपुर  उतरी  भवन",
        "335  प्राथमिक  उर्दू  मकतब  ब्रहमपुर  हाशिम  टोल  भाग  1",
        "336  प्राथमिक  उर्दू  मकतब  ब्रहमपुर  हासिम  टोल  भाग  2",
        "337  प्राथमिक  उर्दू  मकतब  ब्रहमपुर  हाशिम  टोल  भाग  4", "338  प्रा०  वि०  पौनद  भाग  1",
        "339  प्रा०  वि०  पौनद  भाग  2", "340  प्रा०  वि०  पौनद  भाग  3"]

# चनौर  वार्ड  काउंट - 15
id4 = "130010023"
pan4 = "ब्रहमपुर पूर्वी"
gra4 = "ग्राम  पंचायत  ब्रहमपुर पूर्वी   जाले"
mat4 = ["318  इंदिराआवास  प्रा०  विद्यालय  भाग  1", "319  इंदिराआवास  प्रा०  विद्यालय  भाग  2",
        "320  प्रा०  विद्यालय  खपरगडहा", "321  प्राथमिक  वि०  जगजीवन  नगर", "322  मध्य  विद्यालय  सोतिया",
        "323  सामुदायिक  भवन  कटैया  मुसहरी", "324  प्राथमिक  विद्यालय  उर्दू  मकतब  बरैल",
        "325  प्राथमिक  विद्यालय  कटैया  भाग  1", "326  प्राथमिक  विद्यालय  कटैया  भाग  2",
        "327  मध्य  विद्यालय  कटैया"]
id5 = "130010011"
pan5 = "मस्सा"
gra5 = "ग्राम  पंचायत  मस्सा जाले"
mat5 = ["144  दारुल  ओलुम  सरिफिया  सुपौलिया", "145  ,0  वि०  धनकौल  पुराना  भवन  भाग  1",
        "146  म०  वि०  धनकौल  पुराना  भवन  भाग  2", "147  म० वि०  धनकौल  भाग  1", "148  मध्य  विद्यालय  धनकौल  भाग  2",
        "149  प्रा०  वि०  मदिलमन", "150  सहकारिता  भवन  मस्सा",
        "151  आंगनबाड़ी  केंद्र  संख्या  29  पासवान  टोल", "152  प्रा०  वि०  मस्सा  उर्दू",
        "153  प्रा०  वि०  मस्सा  हिंदी  भाग  1", "154  प्रा०  वि०  मस्सा  हिंदी  भाग  2",
        "155  प्रा०  वि०  मस्सा  हिंदी  भाग  3", "156  उच्च  माध्यमिक  विद्यालय  मिर्ज़ापुर  भाग  1",
        "157  उच्च  माध्यमिक  विद्यालय  मिर्ज़ापुर  भाग  2"]

id6 = "130010013"
pan6 = "मुरैठा"
gra6 = "ग्राम  पंचायत  मुरैठा  जाले"
mat6 = ["171  प्रा०  वि०  महुली  भाग  1", "172  प्रा०  वि०  महुली  भाग  2", "173  प्रा०  वि०  महुली  भाग  3",
        "174  प्रा०  वि०  महुली  भाग  4", "175  प्रा०  वि०  मुरैठा  भाग  1", "176  प्रा०  वि०  मुरैठा  भाग  2",
        "177  प्रा०  वि०  उर्दू  भिरोहा  भाग  1",
        "178  प्रा०  वि०  उर्दू  भिरोहा  भाग  2", "179  मध्य  विद्यालय  मुरैठा  भाग  1", "180  पुस्तकालय  भवन  मुरैठा",
        "181  प्रा०  संस्कृत  वि०  मुरैठा  भाग  1", "182  प्रा०  संस्कृत  वि०  मुरैठा  भाग  2",
        "183  प्रा०  संस्कृत  वि०  मुरैठा  भाग  3", "184  प्रा०  संस्कृत  वि०  मुरैठा  भाग  4",
        "185  प्रा०  कन्या  वि०  मुरैठा  भाग  1", "186  प्रा०  कन्या  वि०  मुरैठा  भाग  2",
        "187  प्रा०  कन्या  वि०  मुरैठा  भाग  4", "188  म०  वि०  मुरैठा  भाग  2"]
id7 = "130010022"
pan7 = "रतनपुर"
gra7 = "ग्राम  पंचायत  रतनपुर  जाले"
mat7 = ["304  प्राथमिक  वि०  कलवाडा  भाग  1", "305  प्राथमिक  विद्यालय  कलवाडा  भाग  2",
        "306  हरिजन बैठका  रविदास  टोल  भाग  1", "307  पंचायत  भवन  रतनपुर  भाग  1", "308  पंचायत  भवन  रतनपुर  भाग  2",
        "309  मध्य  विद्यालय  गंगेश्वर  स्थान  भाग  1", "310  मध्य  विद्यालय  गंगेश्वर  स्थान  भाग  2",
        "311  हरिजन  बैठका  रविदास  टोल  भाग  2", "312 म०  वि०  रतनपुर  भाग  1", "313  म०  वि०  रतनपुर  भाग  2",
        "314  सामुदायिक  भवन  मुसहरी  टोल  रतनपुर", "315  म०  वि०  रतनपुर  भाग  3", "316  म०  वि०  रतनपुर भाग  4",
        "317  प्रा०  वि०  अ०  जा०  कटैया  रतनपुर"]
id8 = "130010027"
pan8 = "राढी उत्तरी"
gra8 = "ग्राम  पंचायत  राढी उत्तरी जाले "
mat8 = ["247  247  मकतब  उमरचक", "248  म०  वि०  भमरपुरा", "249  मध्य  विद्यालय  खजूरवाडा  भाग  1",
        "250  प्रा०  वि०  लक्षीमनिया  टोल  खजूरवाडा", "251  मध्य  विद्यालय  खजूरवडा  भाग  2",
        "252  मध्य  सिद्यालय  जहाँगीर  टोल  भाग  1", "253  मदरसा  इस्लामिया  बहरुल  उलूम  जहाँगीर  टोल  भाग  1",
        "254  उत्क्रमित  उच्च  विद्यालय  जहाँगीर  टोल  भाग  1", "255  उत्क्रमित  उच्च  विद्यालय  जहाँगीर  टोला  भाग  3",
        "256  लोहिया  भवन  जहाँगीर  टोला"]

pan9 = "गोढैला"
gra9 = "ग्राम  पंचायत  गोढैला हनुमाननगर"
mat9 = ["89  न्यू  प्रा०  वि०  धनुषी", "90  सार्वजानिक  दरवाज़ा  बसंत  उ०  भाग", "91  उत्क्रमित  मध्य  विद्यालय  बसंत",
        "92  सार्वजानिक  दरवाज़ा  बसंत  द०  भाग", "93  प्रा०  कन्या  विद्यालय  चंदौली  बसंत  उ०  भाग",
        "94  न्यू  प्रा०  वि०  हबीबपुर", "95  म०  वि०  गोढैला  उ०  भाग", "96  म०  वि०  गोढैला  दक्षिणी  भाग",
        "97  म०  विद्यालय  गोढैला  पु०  भाग", "98  न्यू  प्रा०  वि०  नवटोली  हरिनगर",
        "99  उ०  म०  विद्यालय  पोअरिया  उ०  भाग"]
id10 = ""
pan10 = "गोढैला"
gra10 = "ग्राम  पंचायत  गोढैला हनुमाननगर"
mat10 = ["89  न्यू  प्रा०  वि०  धनुषी", "90  सार्वजानिक  दरवाज़ा  बसंत  उ०  भाग", "91  उत्क्रमित  मध्य  विद्यालय  बसंत",
         "92  सार्वजानिक  दरवाज़ा  बसंत  द०  भाग", "93  प्रा०  कन्या  विद्यालय  चंदौली  बसंत  उ०  भाग",
         "94  न्यू  प्रा०  वि०  हबीबपुर", "95  म०  वि०  गोढैला  उ०  भाग", "96  म०  वि०  गोढैला  दक्षिणी  भाग",
         "97  म०  विद्यालय  गोढैला  पु०  भाग", "98  न्यू  प्रा०  वि०  नवटोली  हरिनगर",
         "99  उ०  म०  विद्यालय  पोअरिया  उ०  भाग"]
id11 = ""
pan11 = "गोढैला"
gra11 = "ग्राम  पंचायत  गोढैला हनुमाननगर"
mat11 = ["89  न्यू  प्रा०  वि०  धनुषी", "90  सार्वजानिक  दरवाज़ा  बसंत  उ०  भाग", "91  उत्क्रमित  मध्य  विद्यालय  बसंत",
         "92  सार्वजानिक  दरवाज़ा  बसंत  द०  भाग", "93  प्रा०  कन्या  विद्यालय  चंदौली  बसंत  उ०  भाग",
         "94  न्यू  प्रा०  वि०  हबीबपुर", "95  म०  वि०  गोढैला  उ०  भाग", "96  म०  वि०  गोढैला  दक्षिणी  भाग",
         "97  म०  विद्यालय  गोढैला  पु०  भाग", "98  न्यू  प्रा०  वि०  नवटोली  हरिनगर",
         "99  उ०  म०  विद्यालय  पोअरिया  उ०  भाग"]
id12 = ""
pan12 = "गोढैला"
gra12 = "ग्राम  पंचायत  गोढैला हनुमाननगर"
mat12 = ["89  न्यू  प्रा०  वि०  धनुषी", "90  सार्वजानिक  दरवाज़ा  बसंत  उ०  भाग", "91  उत्क्रमित  मध्य  विद्यालय  बसंत",
         "92  सार्वजानिक  दरवाज़ा  बसंत  द०  भाग", "93  प्रा०  कन्या  विद्यालय  चंदौली  बसंत  उ०  भाग",
         "94  न्यू  प्रा०  वि०  हबीबपुर", "95  म०  वि०  गोढैला  उ०  भाग", "96  म०  वि०  गोढैला  दक्षिणी  भाग",
         "97  म०  विद्यालय  गोढैला  पु०  भाग", "98  न्यू  प्रा०  वि०  नवटोली  हरिनगर",
         "99  उ०  म०  विद्यालय  पोअरिया  उ०  भाग"]
id13 = ""
pan13 = "गोढैला"
gra13 = "ग्राम  पंचायत  गोढैला हनुमाननगर"
mat13 = ["89  न्यू  प्रा०  वि०  धनुषी", "90  सार्वजानिक  दरवाज़ा  बसंत  उ०  भाग", "91  उत्क्रमित  मध्य  विद्यालय  बसंत",
         "92  सार्वजानिक  दरवाज़ा  बसंत  द०  भाग", "93  प्रा०  कन्या  विद्यालय  चंदौली  बसंत  उ०  भाग",
         "94  न्यू  प्रा०  वि०  हबीबपुर", "95  म०  वि०  गोढैला  उ०  भाग", "96  म०  वि०  गोढैला  दक्षिणी  भाग",
         "97  म०  विद्यालय  गोढैला  पु०  भाग", "98  न्यू  प्रा०  वि०  नवटोली  हरिनगर",
         "99  उ०  म०  विद्यालय  पोअरिया  उ०  भाग"]
id14 = ""
pan14 = "गोढैला"
gra14 = "ग्राम  पंचायत  गोढैला हनुमाननगर"
mat14 = ["89  न्यू  प्रा०  वि०  धनुषी", "90  सार्वजानिक  दरवाज़ा  बसंत  उ०  भाग", "91  उत्क्रमित  मध्य  विद्यालय  बसंत",
         "92  सार्वजानिक  दरवाज़ा  बसंत  द०  भाग", "93  प्रा०  कन्या  विद्यालय  चंदौली  बसंत  उ०  भाग",
         "94  न्यू  प्रा०  वि०  हबीबपुर", "95  म०  वि०  गोढैला  उ०  भाग", "96  म०  वि०  गोढैला  दक्षिणी  भाग",
         "97  म०  विद्यालय  गोढैला  पु०  भाग", "98  न्यू  प्रा०  वि०  नवटोली  हरिनगर",
         "99  उ०  म०  विद्यालय  पोअरिया  उ०  भाग"]

s = ["1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20","21","22","23"]
e = ["1","2","3","4","5","6","7","8","9","10","11","12","13","14"]
for x in range(0, 15):
#         crtD(str(x+1),mat2[x],gra2,id2,pan2)
for x in range(0, 13):
    crtD(str(x + 1), mat3[x], gra3, id3, pan3)
# print(mat1.length())
for x in range(0, 10):
    crtD(str(x + 1), mat4[x], gra4, id4, pan4)
for x in range(0, 14):
    crtD(str(x + 1), mat5[x], gra5, id5, pan5)
for x in range(0, 18):
    crtD(str(x + 1), mat6[x], gra6, id6, pan6)
for x in range(0, 14):
    crtD(str(x + 1), mat7[x], gra7, id7, pan7)
for x in range(0, 10):
    crtD(str(x + 1), mat8[x], gra8, id8, pan8)
for x in range(0,11):
        crtD(str(x+1),mat13[x],gra13,id13,pan13)
for x in range(0,11):
        crtD(str(x+1),mat14[x],gra14,id14,pan14)
for x in range(0,11):
        crtD(str(x+1),mat2[x],gra2,id2,pan2)

